using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SimpleCSharpApp
{
    class Program
    {
        // класс program, содержащий метод main - объект приложения
        // main - точка входа в приложение
        static void Main(string[] args)
        {
            // Вывести пользователю простое сообщение.
            Console.WriteLine("***** My First C# Арр *****");
            Console.WriteLine("Hello World");
            Console.WriteLine();
            // Ожидать нажатия клавиши <Enter>, прежде чем завершить работу. 
            Console.ReadLine();
        }
    }
}
